read_verilog -sv -formal -overwrite {workspace}/audio_analyze_7a35t.srcs/sources_1/new/top.v
design -reset-vlog; proc;
write_json {workspace}/netlist/top.json